## Atmos Plan - `vpc-lab-prod` ✅

<details><summary>Ver Plan completo</summary>

```terraform
[0m[1mInitializing the backend...[0m
[0m[32m
Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.[0m
[0m[1mInitializing provider plugins...[0m
- Finding latest version of hashicorp/aws...
- Installing hashicorp/aws v6.35.1...
- Installed hashicorp/aws v6.35.1 (signed by HashiCorp)
Terraform has created a lock file [1m.terraform.lock.hcl[0m to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.[0m

[0m[1m[32mTerraform has been successfully initialized![0m[32m[0m
[0m[32mSwitched to workspace "vpc-lab-prod".[0m
aws_cloudwatch_log_group.flow_logs[0]: Refreshing state... [id=/vpc/flow-logs/vpc-lab-prod]
data.aws_region.current: Reading...
aws_vpc.this: Refreshing state... [id=vpc-00d4965fb8273c798]
aws_iam_role.flow_logs[0]: Refreshing state... [id=flow-logs-role-vpc-lab-prod]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-038c01f3de82fc3c7]
data.aws_region.current: Read complete after 0s [id=eu-west-1]
aws_iam_role_policy.flow_logs[0]: Refreshing state... [id=flow-logs-role-vpc-lab-prod:flow-logs-cw-policy]
aws_internet_gateway.this: Refreshing state... [id=igw-0b7125b18a5b28400]
aws_route_table.isolated: Refreshing state... [id=rtb-0b9d7f3a35fc34dd3]
aws_route_table.private: Refreshing state... [id=rtb-0d9d6a320a193933d]
aws_route_table.public: Refreshing state... [id=rtb-050e456c8b84f6b69]
aws_vpc_endpoint.s3[0]: Refreshing state... [id=vpce-0dfd08776bef4a95b]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.flow_logs[0] is tainted, so must be replaced
-/+ resource "aws_cloudwatch_log_group" "flow_logs" {
      ~ arn                         = "arn:aws:logs:eu-west-1:899237616120:log-group:/vpc/flow-logs/vpc-lab-prod" -> (known after apply)
      ~ deletion_protection_enabled = false -> (known after apply)
      ~ id                          = "/vpc/flow-logs/vpc-lab-prod" -> (known after apply)
      ~ log_group_class             = "STANDARD" -> (known after apply)
        name                        = "/vpc/flow-logs/vpc-lab-prod"
      + name_prefix                 = (known after apply)
        tags                        = {
            "CostCenter"  = "platform"
            "Environment" = "prod"
            "ManagedBy"   = "terraform"
            "VpcName"     = "vpc-lab-prod"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = "arn:aws:iam::899237616120:role/flow-logs-role-vpc-lab-prod"
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + max_aggregation_interval = 60
      + region                   = "eu-west-1"
      + tags                     = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "flow-logs-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                 = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "flow-logs-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = "vpc-00d4965fb8273c798"
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-038c01f3de82fc3c7"
      + association_id                     = (known after apply)
      + auto_provision_zones               = (known after apply)
      + auto_scaling_ips                   = (known after apply)
      + availability_mode                  = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "eu-west-1"
      + regional_nat_gateway_address       = (known after apply)
      + regional_nat_gateway_auto_mode     = (known after apply)
      + route_table_id                     = (known after apply)
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nat-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nat-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                             = (known after apply)
    }

  # aws_network_acl.isolated will be created
  + resource "aws_network_acl" "isolated" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 443
              + protocol        = "tcp"
              + rule_no         = 90
              + to_port         = 443
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.11.0/24"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = -1
              + protocol        = "icmp"
              + rule_no         = 120
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.11.0/24"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.12.0/24"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = -1
              + protocol        = "icmp"
              + rule_no         = 130
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.12.0/24"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 110
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 1024
              + protocol        = "tcp"
              + rule_no         = 90
              + to_port         = 65535
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.11.0/24"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = -1
              + protocol        = "icmp"
              + rule_no         = 120
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.11.0/24"
              + from_port       = 5432
              + protocol        = "tcp"
              + rule_no         = 100
              + to_port         = 5432
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.12.0/24"
              + from_port       = 0
              + icmp_code       = -1
              + icmp_type       = -1
              + protocol        = "icmp"
              + rule_no         = 130
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
          + {
              + action          = "allow"
              + cidr_block      = "10.10.12.0/24"
              + from_port       = 5432
              + protocol        = "tcp"
              + rule_no         = 110
              + to_port         = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + region     = "eu-west-1"
      + subnet_ids = (known after apply)
      + tags       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nacl-isolated-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all   = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nacl-isolated-vpc-lab-prod"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id     = "vpc-00d4965fb8273c798"
    }

  # aws_route.private_nat[0] will be created
  + resource "aws_route" "private_nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "eu-west-1"
      + route_table_id         = "rtb-0d9d6a320a193933d"
      + state                  = (known after apply)
    }

  # aws_route_table_association.isolated[0] will be created
  + resource "aws_route_table_association" "isolated" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-0b9d7f3a35fc34dd3"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.isolated[1] will be created
  + resource "aws_route_table_association" "isolated" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-0b9d7f3a35fc34dd3"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-0d9d6a320a193933d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-0d9d6a320a193933d"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-050e456c8b84f6b69"
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "eu-west-1"
      + route_table_id = "rtb-050e456c8b84f6b69"
      + subnet_id      = (known after apply)
    }

  # aws_subnet.isolated[0] will be created
  + resource "aws_subnet" "isolated" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.21.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-isolated-1"
          + "Tier"        = "isolated"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-isolated-1"
          + "Tier"        = "isolated"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

  # aws_subnet.isolated[1] will be created
  + resource "aws_subnet" "isolated" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.22.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-isolated-2"
          + "Tier"        = "isolated"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-isolated-2"
          + "Tier"        = "isolated"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-private-1"
          + "Tier"        = "private"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-private-1"
          + "Tier"        = "private"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-private-2"
          + "Tier"        = "private"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-private-2"
          + "Tier"        = "private"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-public-1"
          + "Tier"        = "public"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-public-1"
          + "Tier"        = "public"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "eu-west-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.10.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block                                = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "eu-west-1"
      + tags                                           = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-public-2"
          + "Tier"        = "public"
          + "VpcName"     = "vpc-lab-prod"
        }
      + tags_all                                       = {
          + "CostCenter"  = "platform"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "vpc-lab-prod-public-2"
          + "Tier"        = "public"
          + "VpcName"     = "vpc-lab-prod"
        }
      + vpc_id                                         = "vpc-00d4965fb8273c798"
    }

Plan: 17 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + isolated_subnet_ids     = [
      + (known after apply),
      + (known after apply),
    ]
  + nat_gateway_id          = (known after apply)
  + private_subnet_ids      = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids       = [
      + (known after apply),
      + (known after apply),
    ]

Warning: Value for undeclared variable

The root module does not declare a variable named "region" but a value was
found in file "vpc-lab-prod-vpc.terraform.tfvars.json". If you meant to use
this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Value for undeclared variable

The root module does not declare a variable named "environment" but a value
was found in file "vpc-lab-prod-vpc.terraform.tfvars.json". If you meant to
use this value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

Warning: Values for undeclared variables

In addition to the other similar warnings shown, 1 other variable(s) defined
without being declared.

```
</details>

*Actor: @systtekcloud*